# NgPerPaSMSup2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..NgPerPaSMSup2 Property
SymbolTypeId Class See Also
---
Symbol ng/(Pa·s·m²), indicating unit Nanograms per pascal second square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId NgPerPaSMSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NgPerPaSMSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NgPerPaSMSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace